pmo-dataset/variations/graphviz_with_ids/11.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Assign access"];
  "Task_2" [label="Customer submits\ncancellation request"];
  "Task_3" [label="apply charges"];
  "Task_4" [label="Generate account"];
  "Task_5" [label="Send regular updates"];
  "Task_6" [label="Deactivate\nsubscription"];
  "Task_7" [label="Settle final account\nbalance"];
  "Task_8" [label="apply refund"];
  "Task_9" [label="Send renewal\nnotifications"];
  "Task_10" [label="Customer signs up"];
  "Task_11" [label="Set automatic\ntriggers for billing\ncycles"];
  "Task_12" [label="Send product\nenhancements"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];

  "ExclusiveGateway_6" -> "Task_8";
  "Task_11" -> "ParallelGateway_5";
  "Task_5" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Task_1";
  "ExclusiveGateway_6" -> "Task_3";
  "ExclusiveGateway_4" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "Task_9";
  "Task_4" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "ParallelGateway_6" -> "ExclusiveGateway_2";
  "Task_3" -> "ExclusiveGateway_5";
  "Task_12" -> "ParallelGateway_2";
  "ParallelGateway_4" -> "Task_5";
  "ParallelGateway_5" -> "ExclusiveGateway_4";
  "Task_1" -> "ParallelGateway_5";
  "Task_7" -> "ParallelGateway_6";
  "ExclusiveGateway_3" -> "ExclusiveGateway_2";
  "StartNoneEvent_1" -> "Task_10";
  "ExclusiveGateway_6" -> "ExclusiveGateway_5";
  "ExclusiveGateway_1" -> "ExclusiveGateway_4";
  "ParallelGateway_3" -> "Task_6";
  "ParallelGateway_1" -> "Task_11";
  "ExclusiveGateway_2" -> "EndNoneEvent_1";
  "Task_9" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "Task_2";
  "ParallelGateway_3" -> "ExclusiveGateway_6";
  "Task_2" -> "ParallelGateway_3";
  "Task_8" -> "ExclusiveGateway_5";
  "ExclusiveGateway_5" -> "Task_7";
  "ParallelGateway_2" -> "ExclusiveGateway_1";
  "Task_6" -> "ParallelGateway_6";
  "ParallelGateway_4" -> "Task_12";
  "Task_10" -> "Task_4";
}
